## Цей файл містить параметри, які можна змінити, щоб налаштувати гру.
##
## Рядки, що починаються з двох решіток «##» є коментарями і вам не потрібно
## розкоментовувати їх. Рядки, що починаються з однієї решітки «#» є
## закоментованим кодом, і ви можете за потреби розкоментувати їх.


## Основи ######################################################################

## Зрозуміла назва гри. Використовується для задання заголовка вікна за
## стандартом і показується в інтерфейсі та звітах про помилки.
##
## _() навколо рядка позначає його як придатний для перекладу.

define config.name = _("Warframe Drifter Loop")


## Визначає, чи наведений вище заголовок показано на екрані головного меню.
## Установіть значення «False» для приховання заголовка.

define gui.show_name = False


## Версія гри.

define config.version = "1.0"


## Текст, який розміщено на екрані «Про гру». Поставте текст між потрійними
## лапками, а між абзацами залиште порожній рядок.

define gui.about = _p("""
""")


## Коротка назва гри, яка використовується для виконуваних файлів і тек у
## вбудованому дистрибутиві. Дозволено лише символи ASCII та не повинно містити
## пробілів, двокрапок чи крапок з комою.

define build.name = "WarframeDrifterLoop"


## Звуки й музика ##############################################################

## Ці три змінні визначають, серед іншого, які мікшери показуватимуться гравцеві
## за стандартом. Установивши значення «False» одній з них, відповідний мікшер
## буде приховано.

define config.has_sound = True
define config.has_music = True
define config.has_voice = True

## Збереження — вимкнути стандартний автосейв/квіксейв Ren'Py
define config.has_autosave = False
define config.has_quicksave = False
define config.autosave_on_quit = False


## Щоб дозволити користувачеві відтворювати тестовий звук на звуковому або
## голосовому каналі, розкоментуйте рядок нижче та скористайтеся ним, щоб задати
## зразок звуку для відтворення.

# define config.sample_sound = "sample-sound.ogg"
# define config.sample_voice = "sample-voice.ogg"


## Розкоментуйте наступний рядок, щоб налаштувати аудіофайл, який
## відтворюватиметься, коли гравець у головному меню. Цей файл продовжуватиме
## відтворюватися у грі, доки його не буде зупинено або не буде відтворено інший
## файл.

# define config.main_menu_music = "main-menu-theme.ogg"


## Переходи ####################################################################
##
## Ці змінні встановлюють переходи, які використовуються, коли відбуваються
## певні події. Кожна змінна має бути встановлена на певний перехід або «None»,
## щоб вказати, що перехід не слід використовувати.

## Вхід або вихід з меню гри.

define config.enter_transition = dissolve
define config.exit_transition = dissolve


## Між екранами меню гри

define config.intra_transition = dissolve


## Перехід, що використовується після завантаження гри.

define config.after_load_transition = None


## Використовується під час входу в головне меню після завершення гри.

define config.end_game_transition = None


## Змінна для встановлення переходу, який використовується під час запуску
## гри, не існує. Замість цього використовуйте оператор «with» після показу
## початкової сцени.


## Керування вікнами ###########################################################
##
## Цей параметр визначає час показу діалогового вікна. Якщо задано «show», воно
## завжди показуватиметься. Якщо задано «hide», воно показуватиметься лише за
## наявності діалогу. Якщо задано «auto», вікно буде приховано перед операторами
## сцени та показано знову, коли відобразиться діалог.
##
## Після початку гри це можна змінити через оператори «window show», «window
## hide» та «window auto».

define config.window = "auto"


## Переходи, які використовуються для показу та приховування діалогового вікна

define config.window_show_transition = Dissolve(.2)
define config.window_hide_transition = Dissolve(.2)


## Стандартні налаштування #####################################################

## Керує стандартною швидкістю друку тексту. Стандартне значення, 0, означає
## різку появу тексту, а будь-яке інше число означатиме кількість символів за
## секунду для друку.

default preferences.text_cps = 0


## Затримка автоматичного перемотування за стандартом. Більші значення
## призводять до довшого очікування, допустимий діапазон від 0 до 30.

default preferences.afm_time = 15


## Тека збережень ##############################################################
##
## Дозволяє вказати місце на платформі, куди Ren'Py зберігатиме файли збережень
## для цієї гри. Місце розміщення файлів збереження:
##
## Windows: %APPDATA\RenPy\<config.save_directory>
##
## Macintosh: $HOME/Library/RenPy/<config.save_directory>
##
## Linux: $HOME/.renpy/<config.save_directory>
##
## Як правило, його не слід змінювати, а якщо змінювати, то це завжди має бути
## буквальний рядок, а не вираз.

define config.save_directory = "WarframeDrifterLoop-1752083271"


## Значок ######################################################################
##
## Значок, що показується на панелі завдань або док-станції.

define config.window_icon = "gui/window_icon.png"


## Конфігурація збірки #########################################################
##
## Цей розділ керує тим, як Ren'Py перетворює ваш проєкт на файли для
## розповсюдження.

init python:

    ## Наступні функції приймають шаблони файлів. Шаблони файлів не залежать від
    ## регістру і збігаються за шляхом відносно основної теки, з та без скісної
    ## риски «/» на початку. Якщо збігається декілька шаблонів, використовується
    ## перший.
    ##
    ## У шаблоні:
    ##
    ## / є роздільником тек.
    ##
    ## * збігається з усіма символами, окрім роздільника тек.
    ##
    ## ** збігаються з усіма символами, включаючи роздільника тек.
    ##
    ## Наприклад, «*.txt» збігається з файламм txt у базовій теці, «game/**.ogg»
    ## збігається з файлами ogg у теці «game» або будь-якій з її підтек, а
    ## «**.psd» збігається з файлами psd будь-де в проєкті.

    ## Для виключення файлів із збірки файлів розповсюдження, класифікуйте їх як
    ## «None».

    build.classify('**~', None)
    build.classify('**.bak', None)
    build.classify('**/.**', None)
    build.classify('**/#**', None)
    build.classify('**/thumbs.db', None)

    ## Для архівації файлів, класифікуйте їх як «archive».

    # build.classify('game/**.png', 'archive')
    # build.classify('game/**.jpg', 'archive')

    ## Файли, що відповідають шаблонам документації, дублюються у збірці
    ## застосунку для Mac, тому вони зʼявляються як застосунок, так і zip-файл.

    build.documentation('*.html')
    build.documentation('*.txt')


## Для здійснення внутрішньоігрового придбання потрібен ліцензійний ключ
## Google Play. Його можна знайти в консолі розробника Google Play у розділі
## «Монетизація» > «Налаштування монетизації» > «Ліцензування».

# define build.google_play_key = "..."


## Ім’я користувача та назва проєкту, пов’язані з проєктом itch.io, розділені
## скісною рискою.

# define build.itch_project = "renpytom/test-project"
